package com.example.acwrmfryd;

import androidx.appcompat.app.AppCompatActivity;

import android.text.TextUtils;
import android.widget.ExpandableListView;
import android.os.Bundle;
import android.widget.SearchView;
import android.widget.SearchView.OnQueryTextListener;

import static com.example.acwrmfryd.FishExpendAdapter.*;

public class fish extends AppCompatActivity {
    private ExpandableListView expandableListView;
    private FishExpendAdapter fishExpendAdapter;
    private SearchView sv;
    private String[] fishName = new String[]{"红目鲫","溪哥","鲫鱼","雅罗鱼","鲤鱼","锦鲤","金鱼","龙睛金鱼","兰寿金鱼","稻田鱼","淡水龙虾","鳖","拟鳄龟","蝌蚪","青蛙","塘鳢鱼","泥鳅","鲶鱼","黑鱼","蓝鳃太阳鱼","黄鲈鱼","黑鲈鱼","吴郭鱼","白斑狗鱼","西太公鱼","香鱼","樱花钩吻鲑","花糕红点鲑","金鳟","远东哲罗鱼","鲑鱼","帝王鲑","中华绒螯蟹","孔雀鱼","温泉医生鱼","神仙鱼","斗鱼","霓虹灯鱼","彩虹鱼","食人鱼","骨舌鱼","黄金河虎","雀鳝","巨骨舌鱼","恩氏多鳍鱼","鲟鱼","海蝴蝶","海马","小丑鱼","拟刺尾鲷","耳带蝴蝶鱼","苏眉鱼","狮子鱼","河豚","刺豚","凤尾鱼","竹荚鱼","条石鲷","鲈鱼","鲷鱼","鲽鱼","比目鱼","鱿鱼","裸胸鳝","五彩鳗","鲔鱼","旗鱼","白面弄鱼","鬼头刀","翻车鱼","鳐鱼","锯鲨","双髻鲨","鲨鱼","鲸鲨","吸盘鱼","灯笼鱼","皇带鱼","太平洋桶眼鱼","矛尾鱼"};
    private int[] fishPic = new int[]{R.drawable.f1,R.drawable.f2,R.drawable.f3,R.drawable.f4,R.drawable.f5,R.drawable.f6,R.drawable.f7,R.drawable.f8,R.drawable.f9,R.drawable.f10,R.drawable.f11,R.drawable.f12,R.drawable.f13,R.drawable.f14,R.drawable.f15,R.drawable.f16,R.drawable.f17,R.drawable.f18,R.drawable.f19,R.drawable.f20,R.drawable.f21,R.drawable.f22,R.drawable.f23,R.drawable.f24,R.drawable.f25,R.drawable.f26,R.drawable.f27,R.drawable.f28,R.drawable.f29,R.drawable.f30,R.drawable.f31,R.drawable.f32,R.drawable.f33,R.drawable.f34,R.drawable.f35,R.drawable.f36,R.drawable.f37,R.drawable.f38,R.drawable.f39,R.drawable.f40,R.drawable.f41,R.drawable.f42,R.drawable.f43,R.drawable.f44,R.drawable.f45,R.drawable.f46,R.drawable.f47,R.drawable.f48,R.drawable.f49,R.drawable.f50,R.drawable.f51,R.drawable.f52,R.drawable.f53,R.drawable.f54,R.drawable.f55,R.drawable.f56,R.drawable.f57,R.drawable.f58,R.drawable.f59,R.drawable.f60,R.drawable.f61,R.drawable.f62,R.drawable.f63,R.drawable.f64,R.drawable.f65,R.drawable.f66,R.drawable.f67,R.drawable.f68,R.drawable.f69,R.drawable.f70,R.drawable.f71,R.drawable.f72,R.drawable.f73,R.drawable.f74,R.drawable.f75,R.drawable.f76,R.drawable.f77,R.drawable.f78,R.drawable.f79,R.drawable.f80};

    private String[][] fishdetail = new String[][]{{"出现场所：河流","鱼影尺寸：特小","北半球月份：11，12，1，2，3","南半球月份：5，6，7，8，9","出现时间：全天","出售价格：900"},
            {"出现场所：河流","鱼影尺寸：特小","北半球月份：全年","南半球月份：全年","出现时间：9点至16点","出售价格：200"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：160"},
            {"出现场所：河流","鱼影尺寸：中","北半球月份：全年","南半球月份：全年","出现时间：16点至次日9点","出售价格：240"},
            {"出现场所：池塘","鱼影尺寸：稍大","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：300"},
            {"出现场所：池塘","鱼影尺寸：稍大","北半球月份：全年","南半球月份：全年","出现时间：16点至次日9点","出售价格：4000"},
            {"出现场所：池塘","鱼影尺寸：特小","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：1300"},
            {"出现场所：池塘","鱼影尺寸：特小","北半球月份：全年","南半球月份：全年","出现时间：9点至16点","出售价格：1300"},
            {"出现场所：池塘","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：9点至16点","出售价格：4500"},
            {"出现场所：池塘","鱼影尺寸：特小","北半球月份：4，5，6，7，8","南半球月份：10，11，12，1，2","出现时间：全天","出售价格：300"},
            {"出现场所：池塘","鱼影尺寸：稍小","北半球月份：4，5，6，7，8，9","南半球月份：10，11，12，1，2，3","出现时间：全天","出售价格：200"},
            {"出现场所：河流","鱼影尺寸：中","北半球月份：8，9","南半球月份：2，3","出现时间：16点至次日9点","出售价格：3750"},
            {"出现场所：河流","鱼影尺寸：大","北半球月份：4，5，6，7，8，9，10","南半球月份：10，11，12，1，2，3，4","出现时间：21点至次日4点","出售价格：5000"},
            {"出现场所：池塘","鱼影尺寸：特小","北半球月份：3，4，5，6，7","南半球月份：9，10，11，12，1","出现时间：全天","出售价格：100"},
            {"出现场所：池塘","鱼影尺寸：稍小","北半球月份：5，6，7，8","南半球月份：11，12，1，2","出现时间：全天","出售价格：120"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：16点至次日9点","出售价格：400"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：3，4，5","南半球月份：9，10，11","出现时间：全天","出售价格：400"},
            {"出现场所：池塘","鱼影尺寸：稍大","北半球月份：5，6，7，8，9，10","南半球月份：11，12，1，2，3，4","出现时间：16点至次日9点","出售价格：800"},
            {"出现场所：池塘","鱼影尺寸：稍大","北半球月份：6，7，8","南半球月份：12，1，2","出现时间：9点至16点","出售价格：5500"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：9点至16点","出售价格：180"},
            {"出现场所：河流","鱼影尺寸：中","北半球月份：10，11，12，1，2，3","南半球月份：4，5，6，7，8，9","出现时间：全天","出售价格：300"},
            {"出现场所：河流","鱼影尺寸：稍大","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：400"},
            {"出现场所：河流","鱼影尺寸：中","北半球月份：6，7，8，9，10","南半球月份：12，1，2，3，4","出现时间：全天","出售价格：800"},
            {"出现场所：河流","鱼影尺寸：大","北半球月份：9，10，11，12","南半球月份：3，4，5，6","出现时间：全天","出售价格：1800"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：12，1，2","南半球月份：6，7，8","出现时间：全天","出售价格：400"},
            {"出现场所：河流","鱼影尺寸：中","北半球月份：7，8，9","南半球月份：1，2，3","出现时间：全天","出售价格：900"},
            {"出现场所：悬崖","鱼影尺寸：中","北半球月份：3，4，5，6，9，10，11","南半球月份：9，10，11，12，3，4，5","出现时间：全天","出售价格：1000"},
            {"出现场所：悬崖","鱼影尺寸：中","北半球月份：3，4，5，6，9，10，11","南半球月份：9，10，11，12，3，4，5","出现时间：全天","出售价格：3800"},
            {"出现场所：悬崖","鱼影尺寸：中","北半球月份：3，4，5，9，10，11","南半球月份：3，4，5，9，10，11","出现时间：16点至次日9点","出售价格：15000"},
            {"出现场所：悬崖","鱼影尺寸：大","北半球月份：12，1，2，3","南半球月份：6，7，8，9","出现时间：16点至次日9点","出售价格：12000"},
            {"出现场所：海口","鱼影尺寸：稍大","北半球月份：9","南半球月份：3","出现时间：全天","出售价格：700"},
            {"出现场所：海口","鱼影尺寸：特大","北半球月份：9","南半球月份：3","出现时间：全天","出售价格：1800"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：9，10，11","南半球月份：3，4，5","出现时间：16点至次日9点","出售价格：2000"},
            {"出现场所：河流","鱼影尺寸：特小","北半球月份：4，5，6，7，8，9，10，11","南半球月份：10，11，12，1，2，3，4，5","出现时间：9点至16点","出售价格：1300"},
            {"出现场所：河流","鱼影尺寸：特小","北半球月份：5，6，7，8，9","南半球月份：11，12，1，2，3","出现时间：9点至16点","出售价格：1500"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：5，6，7，8，9，10","南半球月份：11，12，1，2，3，4","出现时间：16点至次日9点","出售价格：3000"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：5，6，7，8，9，10","南半球月份：11，12，1，2，3，4","出现时间：9点至16点","出售价格：2500"},
            {"出现场所：河流","鱼影尺寸：特小","北半球月份：4，5，6，7，8，9，10，11","南半球月份：10，11，12，1，2，3，4，5","出现时间：9点至16点","出售价格：500"},
            {"出现场所：河流","鱼影尺寸：特小","北半球月份：6，7，8，9，5，10","南半球月份：12，1，2，3，11，4","出现时间：9点至16点","出售价格：800"},
            {"出现场所：河流","鱼影尺寸：稍小","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：2500"},
            {"出现场所：河流","鱼影尺寸：稍大","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：10000"},
            {"出现场所：河流","鱼影尺寸：大","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：4点至21点","出售价格：15000"},
            {"出现场所：池塘","鱼影尺寸：大","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：6000"},
            {"出现场所：河流","鱼影尺寸：特大","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：10000"},
            {"出现场所：河流","鱼影尺寸：稍大","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：21点至次日4点","出售价格：4000"},
            {"出现场所：海口","鱼影尺寸：特大","北半球月份：9，10，11，12，1，2，3","南半球月份：3，4，5，6，7，8，9","出现时间：全天","出售价格：10000"},
            {"出现场所：大海","鱼影尺寸：特小","北半球月份：12，1，2，3","南半球月份：6，7，8，9","出现时间：全天","出售价格：1000"},
            {"出现场所：大海","鱼影尺寸：特小","北半球月份：4，5，6，7，8，9，10，11","南半球月份：10，11，12，1，2，3，4，5","出现时间：全天","出售价格：1100"},
            {"出现场所：大海","鱼影尺寸：特小","北半球月份：4，5，6，7，8，9","南半球月份：10，11，12，1，2，3","出现时间：全天","出售价格：650"},
            {"出现场所：大海","鱼影尺寸：稍小","北半球月份：4，5，6，7，8，9","南半球月份：10，11，12，1，2，3","出现时间：全天","出售价格：1000"},
            {"出现场所：大海","鱼影尺寸：稍小","北半球月份：4，5，6，7，8，9","南半球月份：10，11，12，1，2，3","出现时间：","出售价格：1000"},
            {"出现场所：大海","鱼影尺寸：特大","北半球月份：7，8","南半球月份：1，2","出现时间：4点至21点","出售价格：10000"},
            {"出现场所：大海","鱼影尺寸：中","北半球月份：4，5，6，7，8，9，10，11","南半球月份：10，11，12，1，2，3，4，5","出现时间：全天","出售价格：500"},
            {"出现场所：大海","鱼影尺寸：中","北半球月份：11，12，1，2","南半球月份：5，6，7，8","出现时间：21点至次日4点","出售价格：5000"},
            {"出现场所：大海","鱼影尺寸：中","北半球月份：7，8，9","南半球月份：1，2，3","出现时间：全天","出售价格：250"},
            {"出现场所：大海","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：9点至21点","出售价格：200"},
            {"出现场所：大海","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：150"},
            {"出现场所：大海","鱼影尺寸：中","北半球月份：3，4，5，6，7，8，9，10，11","南半球月份：9，10，11，12，1，2，3，4，5","出现时间：全天","出售价格：5000"},
            {"出现场所：大海","鱼影尺寸：大","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：400"},
            {"出现场所：大海","鱼影尺寸：稍大","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：3000"},
            {"出现场所：大海","鱼影尺寸：中","北半球月份：10，11，12，1，2，3，4","南半球月份：4，5，6，7，8，9，10","出现时间：全天","出售价格：300"},
            {"出现场所：大海","鱼影尺寸：中偏大","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：800"},
            {"出现场所：大海","鱼影尺寸：中","北半球月份：12，1，2，3，4，5，6，7，8","南半球月份：6，7，8，9，10，11，12，1，2","出现时间：全天","出售价格：500"},
            {"出现场所：大海","鱼影尺寸：细长","北半球月份：8，9，10","南半球月份：2，3，4","出现时间：全天","出售价格：2000"},
            {"出现场所：大海","鱼影尺寸：细长","北半球月份：6，7，8，9，10","南半球月份：12，1，2，3，4","出现时间：全天","出售价格：600"},
            {"出现场所：码头","鱼影尺寸：特大","北半球月份：11，12，1，2，3，4","南半球月份：5，6，7，8，9，10","出现时间：全天","出售价格：7000"},
            {"出现场所：码头","鱼影尺寸：特大","北半球月份：7，8，9，11，12，1，2，3，4","南半球月份：1，2，3，5，6，7，8，9，10","出现时间：全天","出售价格：10000"},
            {"出现场所：码头","鱼影尺寸：大","北半球月份：5，6，7，8，9，10","南半球月份：11，12，1，2，3，4","出现时间：全天","出售价格：4500"},
            {"出现场所：码头","鱼影尺寸：大","北半球月份：5，6，7，8，9，10","南半球月份：11，12，1，2，3，4","出现时间：全天","出售价格：6000"},
            {"出现场所：大海","鱼影尺寸：背鳍","北半球月份：7，8，9","南半球月份：1，2，3","出现时间：4点至21点","出售价格：4000"},
            {"出现场所：大海","鱼影尺寸：大","北半球月份：8，9，10，11","南半球月份：2，3，4，5","出现时间：4点至21点","出售价格：3000"},
            {"出现场所：大海","鱼影尺寸：背鳍","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：12000"},
            {"出现场所：大海","鱼影尺寸：背鳍","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：8000"},
            {"出现场所：大海","鱼影尺寸：背鳍","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：16点至次日9点","出售价格：15000"},
            {"出现场所：大海","鱼影尺寸：背鳍","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：全天","出售价格：13000"},
            {"出现场所：大海","鱼影尺寸：背鳍","北半球月份：6，7，8，9","南半球月份：12，1，2，3","出现时间：全天","出售价格：1500"},
            {"出现场所：大海","鱼影尺寸：稍大","北半球月份：11，12，1，2，3","南半球月份：5，6，7，8，9","出现时间：16点至次日9点","出售价格：2500"},
            {"出现场所：大海","鱼影尺寸：特大","北半球月份：1，2，3，4，5，12","南半球月份：6，7，8，9，10，11","出现时间：全天","出售价格：9000"},
            {"出现场所：大海","鱼影尺寸：稍小","北半球月份：全年","南半球月份：全年","出现时间：21点至次日4点","出售价格：15000"},
            {"出现场所：大海","鱼影尺寸：特大","北半球月份：全年","南半球月份：全年","出现时间：全天","出售价格：15000"}
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_fish);
        expandableListView = findViewById(R.id.elvfish);
        fishExpendAdapter = new FishExpendAdapter(this, fishName,fishdetail,fishPic);
        expandableListView.setAdapter(fishExpendAdapter);
        expandableListView.setTextFilterEnabled(true);
        sv = (SearchView)findViewById(R.id.searchView);

        expandableListView.setOnGroupExpandListener(new ExpandableListView.OnGroupExpandListener() {
            @Override
            public void onGroupExpand(int groupPosition) {
                int count = expandableListView.getExpandableListAdapter().getGroupCount();
                for(int j = 0; j < count; j++){
                    if(j != groupPosition){
                        expandableListView.collapseGroup(j);
                    }
                }
            }
        });
        sv.setOnQueryTextListener(new OnQueryTextListener() {
                                      @Override
                                      public boolean onQueryTextSubmit(String query) {
                                          return false;
                                      }

                                      @Override
                                      public boolean onQueryTextChange(String newText) {
                                          return true;
                                      }
                                  }
        );
    }

}
